Table of Contents
 Class ResultOfDeformation
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of deformation in the one positon
[Obfuscation(Feature = "renaming")]
public class ResultOfDeformation : SectionResultBase
Inheritance
object
SectionResultBase
ResultOfDeformation
Inherited Members
 SectionResultBase.Loading
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOfDeformation()
Constructor
public ResultOfDeformation()
Properties
 Fix
Rotation around x-axis
public double Fix { get; set; }
Property Value
double
 Fiy
Rotation around y-axis
public double Fiy { get; set; }
Property Value
double
 Fiz
Rotation around z-axis
public double Fiz { get; set; }
Property Value
double
 Ux
Deformation in the x direction
public double Ux { get; set; }
Property Value
double
 Uy
Deformation in the y direction
public double Uy { get; set; }
Property Value
double
 Uz
Deformation in the z direction
public double Uz { get; set; }
Property Value
double
 Edit this page